; ModuleID = './ep.A.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@main.dum = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 1.000000e+00, double 1.000000e+00], align 16
@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"%15.0lf\00", align 1
@str = private unnamed_addr constant [57 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - EP Benchmark\00"
@.str.4 = private unnamed_addr constant [44 x i8] c"\0A Number of random numbers generated: %15s\0A\00", align 1
@x = internal global [131072 x double] zeroinitializer, align 16, !dbg !0
@q = internal unnamed_addr global [10 x double] zeroinitializer, align 16, !dbg !13
@str.26 = private unnamed_addr constant [24 x i8] c"\0AEP Benchmark Results:\0A\00"
@.str.6 = private unnamed_addr constant [19 x i8] c"CPU Time =%10.4lf\0A\00", align 1
@.str.7 = private unnamed_addr constant [11 x i8] c"N = 2^%5d\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "x", scope: !2, file: !3, line: 68, type: !19, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !10, globals: !12)
!3 = !DIFile(filename: "ep.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4, size: 32, elements: !7)
!6 = !DIFile(filename: "../common/type.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "false", value: 0)
!9 = !DIEnumerator(name: "true", value: 1)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !{!0, !13}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "q", scope: !2, file: !3, line: 69, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 640, elements: !17)
!16 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!17 = !{!18}
!18 = !DISubrange(count: 10)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8388608, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 131072)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "elapsed", scope: !24, file: !30, line: 20, type: !31, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C99, file: !25, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !27)
!25 = !DIFile(filename: "../common/c_timers.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!26 = !{}
!27 = !{!28, !22}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "start", scope: !24, file: !30, line: 20, type: !31, isLocal: true, isDefinition: true)
!30 = !DIFile(filename: "c_timers.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 4096, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 64)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "sec", scope: !36, file: !37, line: 9, type: !55, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "wtime_", scope: !37, file: !37, line: 7, type: !38, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, unit: !41, variables: !43)
!37 = !DIFile(filename: "../common/wtime.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !37, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !42)
!42 = !{!34}
!43 = !{!44, !45}
!44 = !DILocalVariable(name: "t", arg: 1, scope: !36, file: !37, line: 7, type: !40)
!45 = !DILocalVariable(name: "tv", scope: !36, file: !37, line: 10, type: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !47, line: 30, size: 128, elements: !48)
!47 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!48 = !{!49, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !46, file: !47, line: 32, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !51, line: 148, baseType: !52)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !46, file: !47, line: 33, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !51, line: 150, baseType: !52)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = distinct !DICompileUnit(language: DW_LANG_C99, file: !57, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58)
!57 = !DIFile(filename: "../common/print_results.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!58 = !{!59}
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 4, size: 32, elements: !7)
!60 = !DIFile(filename: "../common/type.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, retainedTypes: !63)
!62 = !DIFile(filename: "../common/randdp.c", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/common")
!63 = !{!55}
!64 = !{!"clang version 6.0.0 (tags/RELEASE_600/final)"}
!65 = !{i32 1, !"ProfileSummary", !66}
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !{!"ProfileFormat", !"InstrProf"}
!68 = !{!"TotalCount", i64 1121842441}
!69 = !{!"MaxCount", i64 536870912}
!70 = !{!"MaxInternalCount", i64 536870912}
!71 = !{!"MaxFunctionCount", i64 65556}
!72 = !{!"NumCounts", i64 48}
!73 = !{!"NumFunctions", i64 10}
!74 = !{!"DetailedSummary", !75}
!75 = !{!76, !77, !78, !79, !80, !81, !81, !82, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!76 = !{i32 10000, i64 536870912, i32 1}
!77 = !{i32 100000, i64 536870912, i32 1}
!78 = !{i32 200000, i64 536870912, i32 1}
!79 = !{i32 300000, i64 536870912, i32 1}
!80 = !{i32 400000, i64 536870912, i32 1}
!81 = !{i32 500000, i64 268435456, i32 2}
!82 = !{i32 600000, i64 268435456, i32 2}
!83 = !{i32 700000, i64 268435456, i32 2}
!84 = !{i32 800000, i64 210832767, i32 3}
!85 = !{i32 900000, i64 210832767, i32 3}
!86 = !{i32 950000, i64 105424685, i32 4}
!87 = !{i32 990000, i64 105424685, i32 4}
!88 = !{i32 999000, i64 105424685, i32 4}
!89 = !{i32 999900, i64 65556, i32 6}
!90 = !{i32 999990, i64 4098, i32 9}
!91 = !{i32 999999, i64 4096, i32 11}
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 72, type: !96, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: true, unit: !2, variables: !97)
!96 = !DISubroutineType(types: !63)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !126, !127, !131, !136}
!98 = !DILocalVariable(name: "Mops", scope: !95, file: !3, line: 74, type: !16)
!99 = !DILocalVariable(name: "t1", scope: !95, file: !3, line: 74, type: !16)
!100 = !DILocalVariable(name: "t2", scope: !95, file: !3, line: 74, type: !16)
!101 = !DILocalVariable(name: "t3", scope: !95, file: !3, line: 74, type: !16)
!102 = !DILocalVariable(name: "t4", scope: !95, file: !3, line: 74, type: !16)
!103 = !DILocalVariable(name: "x1", scope: !95, file: !3, line: 74, type: !16)
!104 = !DILocalVariable(name: "x2", scope: !95, file: !3, line: 74, type: !16)
!105 = !DILocalVariable(name: "sx", scope: !95, file: !3, line: 75, type: !16)
!106 = !DILocalVariable(name: "sy", scope: !95, file: !3, line: 75, type: !16)
!107 = !DILocalVariable(name: "tm", scope: !95, file: !3, line: 75, type: !16)
!108 = !DILocalVariable(name: "an", scope: !95, file: !3, line: 75, type: !16)
!109 = !DILocalVariable(name: "tt", scope: !95, file: !3, line: 75, type: !16)
!110 = !DILocalVariable(name: "gc", scope: !95, file: !3, line: 75, type: !16)
!111 = !DILocalVariable(name: "sx_verify_value", scope: !95, file: !3, line: 76, type: !16)
!112 = !DILocalVariable(name: "sy_verify_value", scope: !95, file: !3, line: 76, type: !16)
!113 = !DILocalVariable(name: "sx_err", scope: !95, file: !3, line: 76, type: !16)
!114 = !DILocalVariable(name: "sy_err", scope: !95, file: !3, line: 76, type: !16)
!115 = !DILocalVariable(name: "np", scope: !95, file: !3, line: 77, type: !55)
!116 = !DILocalVariable(name: "i", scope: !95, file: !3, line: 78, type: !55)
!117 = !DILocalVariable(name: "ik", scope: !95, file: !3, line: 78, type: !55)
!118 = !DILocalVariable(name: "kk", scope: !95, file: !3, line: 78, type: !55)
!119 = !DILocalVariable(name: "l", scope: !95, file: !3, line: 78, type: !55)
!120 = !DILocalVariable(name: "k", scope: !95, file: !3, line: 78, type: !55)
!121 = !DILocalVariable(name: "nit", scope: !95, file: !3, line: 78, type: !55)
!122 = !DILocalVariable(name: "k_offset", scope: !95, file: !3, line: 79, type: !55)
!123 = !DILocalVariable(name: "j", scope: !95, file: !3, line: 79, type: !55)
!124 = !DILocalVariable(name: "verified", scope: !95, file: !3, line: 80, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !6, line: 4, baseType: !5)
!126 = !DILocalVariable(name: "timers_enabled", scope: !95, file: !3, line: 80, type: !125)
!127 = !DILocalVariable(name: "dum", scope: !95, file: !3, line: 82, type: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 192, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 3)
!131 = !DILocalVariable(name: "size", scope: !95, file: !3, line: 83, type: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !134)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DILocalVariable(name: "fp", scope: !95, file: !3, line: 85, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !139, line: 48, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !141, line: 246, size: 1728, elements: !142)
!141 = !DIFile(filename: "/usr/include/libio.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!142 = !{!143, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !164, !165, !166, !167, !170, !172, !174, !178, !181, !183, !184, !185, !186, !187, !191, !192}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !140, file: !141, line: 247, baseType: !55, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !140, file: !141, line: 252, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !140, file: !141, line: 253, baseType: !145, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !140, file: !141, line: 254, baseType: !145, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !140, file: !141, line: 255, baseType: !145, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !140, file: !141, line: 256, baseType: !145, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !140, file: !141, line: 257, baseType: !145, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !140, file: !141, line: 258, baseType: !145, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !140, file: !141, line: 259, baseType: !145, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !140, file: !141, line: 261, baseType: !145, size: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !140, file: !141, line: 262, baseType: !145, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !140, file: !141, line: 263, baseType: !145, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !140, file: !141, line: 265, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !141, line: 161, size: 192, elements: !159)
!159 = !{!160, !161, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !158, file: !141, line: 162, baseType: !157, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !158, file: !141, line: 163, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !158, file: !141, line: 167, baseType: !55, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !140, file: !141, line: 267, baseType: !162, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !140, file: !141, line: 269, baseType: !55, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !140, file: !141, line: 273, baseType: !55, size: 32, offset: 928)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !140, file: !141, line: 275, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !169, line: 140, baseType: !52)
!169 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !140, file: !141, line: 279, baseType: !171, size: 16, offset: 1024)
!171 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !140, file: !141, line: 280, baseType: !173, size: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !140, file: !141, line: 281, baseType: !175, size: 8, offset: 1048)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !140, file: !141, line: 285, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !141, line: 155, baseType: null)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !140, file: !141, line: 294, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !169, line: 141, baseType: !52)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !140, file: !141, line: 303, baseType: !11, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !140, file: !141, line: 304, baseType: !11, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !140, file: !141, line: 305, baseType: !11, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !140, file: !141, line: 306, baseType: !11, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !140, file: !141, line: 307, baseType: !188, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !189, line: 62, baseType: !190)
!189 = !DIFile(filename: "/users2/mcopik/projects/clang-6.0/install/lib/clang/6.0.0/include/stddef.h", directory: "/users/mcopik/projects/mlcode/nas_benchmarks/SNU_NPB-1.0.3/NPB3.3-SER-C/EP")
!190 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !140, file: !141, line: 309, baseType: !55, size: 32, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !140, file: !141, line: 311, baseType: !193, size: 160, offset: 1568)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 160, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 20)
!196 = !{!"function_entry_count", i64 1}
!197 = !DILocation(line: 74, column: 3, scope: !95)
!198 = !DILocation(line: 82, column: 3, scope: !95)
!199 = !DILocation(line: 82, column: 10, scope: !95)
!200 = !DILocation(line: 83, column: 3, scope: !95)
!201 = !DILocation(line: 83, column: 10, scope: !95)
!202 = !DILocation(line: 87, column: 13, scope: !203)
!203 = distinct !DILexicalBlock(scope: !95, file: !3, line: 87, column: 7)
!204 = !DILocation(line: 85, column: 9, scope: !95)
!205 = !DILocation(line: 87, column: 39, scope: !203)
!206 = !DILocation(line: 87, column: 7, scope: !95)
!207 = !{!"branch_weights", i32 2, i32 1}
!208 = !DILocation(line: 80, column: 21, scope: !95)
!209 = !DILocation(line: 91, column: 5, scope: !210)
!210 = distinct !DILexicalBlock(scope: !203, file: !3, line: 89, column: 10)
!211 = !DILocation(line: 101, column: 3, scope: !95)
!212 = !DILocation(line: 79, column: 20, scope: !95)
!213 = !DILocation(line: 103, column: 7, scope: !214)
!214 = distinct !DILexicalBlock(scope: !95, file: !3, line: 103, column: 7)
!215 = !{!216, !216, i64 0}
!216 = !{!"omnipotent char", !217, i64 0}
!217 = !{!"Simple C/C++ TBAA"}
!218 = !DILocation(line: 103, column: 15, scope: !214)
!219 = !DILocation(line: 103, column: 7, scope: !95)
!220 = !{!"branch_weights", i32 1, i32 2}
!221 = !DILocation(line: 104, column: 3, scope: !95)
!222 = !DILocation(line: 104, column: 13, scope: !95)
!223 = !DILocation(line: 105, column: 3, scope: !95)
!224 = !DILocation(line: 106, column: 3, scope: !95)
!225 = !DILocation(line: 80, column: 11, scope: !95)
!226 = !DILocation(line: 77, column: 10, scope: !95)
!227 = !DILocation(line: 125, column: 14, scope: !95)
!228 = !DILocation(line: 125, column: 22, scope: !95)
!229 = !DILocation(line: 125, column: 31, scope: !95)
!230 = !DILocation(line: 125, column: 3, scope: !95)
!231 = !DILocation(line: 126, column: 28, scope: !95)
!232 = !{!233, !233, i64 0}
!233 = !{!"double", !216, i64 0}
!234 = !DILocation(line: 126, column: 12, scope: !95)
!235 = !DILocation(line: 126, column: 10, scope: !95)
!236 = !DILocation(line: 78, column: 10, scope: !95)
!237 = !DILocation(line: 127, column: 3, scope: !238)
!238 = distinct !DILexicalBlock(scope: !95, file: !3, line: 127, column: 3)
!239 = !DILocation(line: 127, column: 28, scope: !240)
!240 = distinct !DILexicalBlock(scope: !238, file: !3, line: 127, column: 3)
!241 = !DILocation(line: 128, column: 5, scope: !242)
!242 = distinct !DILexicalBlock(scope: !240, file: !3, line: 127, column: 32)
!243 = !DILocation(line: 128, column: 10, scope: !242)
!244 = distinct !{!244, !237, !245, !246}
!245 = !DILocation(line: 129, column: 3, scope: !238)
!246 = !{!"llvm.loop.isvectorized", i32 1}
!247 = !DILocation(line: 132, column: 3, scope: !95)
!248 = !DILocation(line: 133, column: 3, scope: !95)
!249 = !DILocation(line: 134, column: 3, scope: !95)
!250 = !DILocation(line: 135, column: 3, scope: !95)
!251 = !DILocation(line: 74, column: 16, scope: !95)
!252 = !DILocation(line: 137, column: 6, scope: !95)
!253 = !DILocation(line: 138, column: 3, scope: !95)
!254 = !DILocation(line: 144, column: 6, scope: !95)
!255 = !DILocation(line: 147, column: 10, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 146, column: 32)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 146, column: 3)
!258 = distinct !DILexicalBlock(scope: !95, file: !3, line: 146, column: 3)
!259 = !DILocation(line: 74, column: 20, scope: !95)
!260 = !DILocation(line: 147, column: 8, scope: !256)
!261 = !DILocation(line: 75, column: 22, scope: !95)
!262 = !DILocation(line: 75, column: 26, scope: !95)
!263 = !DILocation(line: 75, column: 30, scope: !95)
!264 = !DILocation(line: 75, column: 10, scope: !95)
