tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
cask "xquartz"
brew "gettext"
brew "libffi"
brew "gdk-pixbuf"
brew "graphite2"
brew "python"
brew "adwaita-icon-theme"
brew "aspell"
brew "atk"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bazel"
brew "binutils"
brew "boost"
brew "buildifier"
brew "cabextract"
brew "clang-format", link: false
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cppcheck"
brew "cscope"
brew "curl", link: true
brew "dbus"
brew "dbus-glib"
brew "dos2unix"
brew "doxygen"
brew "duti"
brew "enscript"
brew "exempi"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gd"
brew "gdb"
brew "ghostscript", link: false
brew "git"
brew "git-flow"
brew "git-lfs"
brew "glew"
brew "libsigc++"
brew "glibmm"
brew "glm"
brew "global"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnuplot", args: ["with-cairo", "with-wxmac", "with-x11", "without-lua"]
brew "nettle"
brew "gnutls"
brew "go"
brew "libtool"
brew "graphicsmagick"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gtksourceview3"
brew "hdf5"
brew "htop"
brew "imagemagick"
brew "jbig2dec"
brew "jq"
brew "lastpass-cli"
brew "leiningen"
brew "libgpg-error"
brew "libassuan"
brew "libevent"
brew "libyaml"
brew "llvm"
brew "lua"
brew "macvim"
brew "mas"
brew "md5sha1sum"
brew "mysql", restart_service: true
brew "ncdu"
brew "ninja"
brew "nmap"
brew "node"
brew "ntfs-3g"
brew "pandoc"
brew "parallel"
brew "pbzip2"
brew "pdflib-lite"
brew "perl"
brew "pinentry"
brew "poppler"
brew "postgresql"
brew "protobuf"
brew "py2cairo"
brew "pygobject3"
brew "python@2", link: false
brew "rbenv"
brew "ripgrep"
brew "rmtrash"
brew "ruby"
brew "sdl2"
brew "sdl2_image"
brew "sloccount"
brew "splint"
brew "tbb"
brew "tidy-html5"
brew "tmux"
brew "unzip", link: true
brew "utf8proc"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "wdiff"
brew "wget"
brew "zeromq"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "adobe-creative-cloud"
cask "alfred"
cask "anki"
cask "atom"
cask "bartender"
cask "bettertouchtool"
cask "caffeine"
cask "calibre"
cask "clion"
cask "cmake"
cask "cuda"
cask "dash"
cask "datagrip"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "emacs"
cask "etcher"
cask "fantastical"
cask "fluid"
cask "flux"
cask "goland"
cask "google-chrome"
cask "google-earth-pro"
cask "google-nik-collection"
cask "google-photos-backup-and-sync"
cask "hipchat"
cask "imageoptim"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "java8"
cask "julia"
cask "mactex"
cask "mendeley"
cask "microsoft-office"
cask "mysqlworkbench"
cask "omnifocus"
cask "omnigraffle"
cask "omnioutliner"
cask "omnipresence"
cask "plex-media-player"
cask "plex-media-server"
cask "pycharm"
cask "rocket"
cask "skype"
cask "steam"
cask "sublime-text"
cask "texstudio"
cask "timing"
cask "tower"
cask "transmission"
cask "tunnelblick"
cask "unified-remote"
cask "virtualbox"
cask "vlc"
cask "wacom-intuos-tablet"
mas "1Password", id: 443987910
mas "Be Focused Pro", id: 961632517
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brightness Slider", id: 456624497
mas "Byword", id: 420212497
mas "CloudClip Manager", id: 563362017
mas "GIPHY CAPTURE", id: 668208984
mas "GoodNotes", id: 1026566364
mas "Keynote", id: 409183694
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Server", id: 883878097
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
