{
  "max_encoded_length": 105880412,
  "vocab": {
    "0": 54,
    "1": 32,
    "2": 33,
    "3": 36,
    "4": 30,
    "5": 57,
    "6": 29,
    "7": 62,
    "8": 34,
    "9": 63,
    "\n": 13,
    " ": 1,
    "!": 55,
    "\"": 23,
    "#": 53,
    "$": 139,
    "%": 60,
    "&": 147,
    "'": 11,
    "(": 46,
    ")": 49,
    "*": 50,
    "+": 95,
    ",": 51,
    "-": 12,
    ".": 84,
    "/": 85,
    ":": 28,
    ";": 0,
    "<": 92,
    "=": 10,
    ">": 93,
    "?": 158,
    "@": 45,
    "A": 40,
    "B": 117,
    "C": 116,
    "D": 9,
    "E": 87,
    "F": 39,
    "G": 123,
    "H": 124,
    "I": 8,
    "J": 125,
    "K": 119,
    "L": 88,
    "M": 2,
    "N": 120,
    "O": 121,
    "P": 122,
    "Q": 136,
    "R": 86,
    "S": 89,
    "T": 144,
    "U": 128,
    "V": 148,
    "W": 141,
    "X": 155,
    "Y": 150,
    "Z": 97,
    "[": 106,
    "\\": 135,
    "]": 107,
    "^": 146,
    "_": 17,
    "`": 145,
    "a": 21,
    "add": 48,
    "alloca": 61,
    "and": 113,
    "ashr": 111,
    "atomicrmw": 164,
    "b": 58,
    "bitcast": 115,
    "br": 91,
    "c": 16,
    "call": 65,
    "cmpxchg": 152,
    "constant": 134,
    "d": 4,
    "declare": 79,
    "define": 42,
    "double": 114,
    "e": 7,
    "extractelement": 94,
    "extractvalue": 143,
    "f": 18,
    "fadd": 75,
    "fcmp": 104,
    "fdiv": 100,
    "fence": 156,
    "float": 47,
    "fmul": 98,
    "fneg": 157,
    "fp128": 166,
    "fpext": 129,
    "fptoui": 162,
    "fptrunc": 130,
    "frem": 159,
    "fsub": 76,
    "g": 25,
    "getelementptr": 74,
    "h": 81,
    "half": 154,
    "i": 19,
    "i128": 31,
    "i32": 52,
    "i64": 27,
    "icmp": 90,
    "indirectbr": 163,
    "insertelement": 101,
    "insertvalue": 167,
    "inttoptr": 138,
    "invoke": 160,
    "j": 82,
    "k": 43,
    "l": 6,
    "landingpad": 168,
    "load": 68,
    "lshr": 109,
    "m": 22,
    "mul": 70,
    "n": 20,
    "nocapture": 118,
    "nounwind": 41,
    "o": 3,
    "or": 80,
    "p": 37,
    "phi": 105,
    "private": 132,
    "ptrtoint": 142,
    "q": 56,
    "r": 15,
    "resume": 151,
    "ret": 77,
    "s": 14,
    "sdiv": 112,
    "select": 131,
    "sext": 96,
    "shl": 110,
    "shufflevector": 102,
    "sitofp": 99,
    "srem": 126,
    "store": 64,
    "sub": 108,
    "switch": 137,
    "t": 24,
    "to": 67,
    "trunc": 66,
    "u": 5,
    "udiv": 72,
    "uitofp": 103,
    "unnamed_addr": 133,
    "unreachable": 149,
    "urem": 69,
    "v": 35,
    "va_arg": 165,
    "void": 44,
    "w": 71,
    "x": 38,
    "x86_fp80": 161,
    "xor": 127,
    "y": 26,
    "z": 83,
    "zext": 73,
    "{": 59,
    "|": 153,
    "}": 78,
    "~": 140
  }
}